"""

Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі
класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що
за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість
столів необхідно придбати?

Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число
користувач вводить в окремому рядку.

Вихідні дані: число - кількість столів
"""
from math import ceil
group1 = int(input("Number of students:"))
group2 = int(input("Number of students:"))
group3 = int(input("Number of students:"))
all = ceil(group1/2+group2/2+group3/2)
print("number of tables=", all)
