# task3-------------------------------------------------------------------------
"""

Умова: N студентів отримали K яблук і розподілити їх між собою порівну.
Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент?
Скільки яблук залишиться в кошику?

Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на
поставлені вище питання.

Вхідні дані: 2 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге -
кількість яблук, що лишилось у кошику.
"""

n = int(input("Number of students:"))
k = int(input("Number of apples:"))
given_apples = k//n
apples_left = k%n
print("Every student got", given_apples, "apples","\n","There are", apples_left, "apples left")
